#include "MBC.h"
int bc_printA(char *str)
{
    printf("\E(0%s\E(B", str);
    return 0;
}
int bc_box (int x1, int y1, int x2, int y2)
{
    int temp;
    int scrn_x, scrn_y;
    if (x1 > x2)
    {
        temp = x1;
        x1 = x2;
        x2 = temp;
    }
    if (y1 > y2)
    {
        temp = y1;
        y1 = y2;
        y2 = temp;
    }
    mt_getscreensize(&scrn_x, &scrn_y);
    if ((x1 < 0) || (y1 < 0) || (x2 > scrn_x) || (y2 > scrn_y))
        return 1;
    mt_goto(x1, y1);
    bc_printA("l");//верний левый угол
    for (int i = x1 +1; i < x2; i++)
    {  
//        mt_goto(i, y1)
        bc_printA("r");//верхний правый угол
    }
    bc_printA("q");
    for (int i = y1 +1; i < y2; i++)
    {
        mt_goto(x1, y1);
        bc_printA("t");//строка вниз слева
        mt_goto(x2, y2);
        bc_printA("s");//строка вниз справа
    }
    mt_goto(x1, y2);
    bc_printA("w");//левый нижний угол
    for (int i = x1 +1; i < x2; i++)
    {
//       mt_goto(i, y2);
        bc_printA("e");//праввый нижний гол
    }
    bc_printA("x");
//  получается как, х1 ставишь, от него пока х2 пишишь правый бокс, также для у, только вертикальный
    return 0;
}
int bc_printbigchar(int *big, int x, int y, enum colors bg, enum colors fg)
{
    int temp, pos;
    char row[7];
    mt_setbgcolors(bg);
    mt_setfgcolors(fg);
    for (int i = 0; i < 7; i++)
    {
        temp = big[pos];
        for (int j = 0; j < 7; j++)
        {
            temp = temp << (32 - j);
            temp = temp >> (32 + j);
            if (temp == 0)
            {
                row[j] = ' ';
            }
            else
            {
                row[j] = ;
            }
        }
        mt_goto(x, y);
        bc_printA(row);
    }

}
int bc_setbigcharpos(int *big, int x, int y, int value)
{
    int pos;
}
int bc_getbigcharpos(int *big, int x, int y, int *value)
{

}
int bc_bigcharwrite(int fd, int *big, int count)
{

}
int bc_bigcharread(int fd, int *big, int need_cout, int *count)
{

}


int bcint0 [2] = {1717976064, 3958374};	//0b01100110011001100011110000000000, 0b00000000001111000110011001100110
int bcint1 [2] = {1010315264, 3158064};	//0b00111100001110000011000000000000, 0b00000000001100000011000000110000
int bcint2 [2] = {1010842624, 8258050};	//0b00111100010000000011110000000000, 0b00000000011111100000001000000010
int bcint3 [2] = {2120252928, 8282238};	//0b01111110011000000111111000000000, 0b00000000011111100110000001111110
int bcint4 [2] = {2120640000, 6316158};	//0b01111110011001100110011000000000, 0b00000000011000000110000001111110
int bcint5 [2] = {1040350720, 4079680};	//0b00111110000000100111111000000000, 0b00000000001111100100000001000000
int bcint6 [2] = {35789824, 1974814};	//0b00000010001000100001110000000000, 0b00000000000111100010001000011110
int bcint7 [2] = {811630080, 396312};	//0b00110000011000000111111000000000, 0b00000000000001100000110000011000
int bcint8 [2] = {1013332992, 3958374};	//0b00111100011001100011110000000000, 0b00000000001111000110011001100110;
int bcint9 [2] = {2087074816, 3956832};	//0b01111100011001100011110000000000, 0b00000000001111000110000001100000
int bcintA [2] = {2118269952, 4342338};	//0b01111110010000100011110000000000, 0b00000000010000100100001001000010
int bcintB [2] = {1044528640, 4080194};	//0b00111110010000100011111000000000, 0b00000000001111100100001001000010
int bcintC [2] = {37895168, 3949058};	//0b00000010010000100011110000000000, 0b00000000001111000100001000000010
int bcintD [2] = {1111637504, 4080194};	//0b01000010010000100011111000000000, 0b00000000001111100100001001000010
int bcintE [2] = {2114092544, 8258050};	//0b01111110000000100111111000000000, 0b00000000011111100000001000000010
int bcintF [2] = {33717760, 131646};	//0b00000010000000100111111000000000, 0b00000000000000100000001000111110
int bcintp [2] = {2115508224, 1579134};	//0b01111110000110000001100000000000, 0b00000000000110000001100001111110